### 📦 Plan for `sbx/eu-west-1/infra-01/vpc`
```hcl
03:39:55.931 STDOUT terraform: Terraform used the selected providers to generate the following execution
03:39:55.931 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
03:39:55.931 STDOUT terraform:   + create
03:39:55.931 STDOUT terraform: Terraform will perform the following actions:
03:39:55.931 STDOUT terraform:   # aws_eip.nat_gw_elastic_ip will be created
03:39:55.932 STDOUT terraform:   + resource "aws_eip" "nat_gw_elastic_ip" {
03:39:55.932 STDOUT terraform:       + allocation_id        = (known after apply)
03:39:55.932 STDOUT terraform:       + arn                  = (known after apply)
03:39:55.932 STDOUT terraform:       + association_id       = (known after apply)
03:39:55.932 STDOUT terraform:       + carrier_ip           = (known after apply)
03:39:55.932 STDOUT terraform:       + customer_owned_ip    = (known after apply)
03:39:55.932 STDOUT terraform:       + domain               = "vpc"
03:39:55.932 STDOUT terraform:       + id                   = (known after apply)
03:39:55.932 STDOUT terraform:       + instance             = (known after apply)
03:39:55.932 STDOUT terraform:       + ipam_pool_id         = (known after apply)
03:39:55.932 STDOUT terraform:       + network_border_group = (known after apply)
03:39:55.932 STDOUT terraform:       + network_interface    = (known after apply)
03:39:55.932 STDOUT terraform:       + private_dns          = (known after apply)
03:39:55.932 STDOUT terraform:       + private_ip           = (known after apply)
03:39:55.932 STDOUT terraform:       + ptr_record           = (known after apply)
03:39:55.932 STDOUT terraform:       + public_dns           = (known after apply)
03:39:55.932 STDOUT terraform:       + public_ip            = (known after apply)
03:39:55.932 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
03:39:55.932 STDOUT terraform:       + tags                 = {
03:39:55.932 STDOUT terraform:           + "Name" = "sbx-dev-eu-west-1-infra-01-nap-eip"
03:39:55.932 STDOUT terraform:         }
03:39:55.932 STDOUT terraform:       + tags_all             = {
03:39:55.932 STDOUT terraform:           + "Data-classification" = "internal"
03:39:55.932 STDOUT terraform:           + "Environment"         = "dev"
03:39:55.933 STDOUT terraform:           + "Managed-by"          = "terragrunt"
03:39:55.933 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-nap-eip"
03:39:55.933 STDOUT terraform:           + "Organization"        = "genopsx"
03:39:55.933 STDOUT terraform:         }
03:39:55.933 STDOUT terraform:       + vpc                  = (known after apply)
03:39:55.933 STDOUT terraform:     }
03:39:55.933 STDOUT terraform:   # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
03:39:55.933 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "flow_log" {
03:39:55.933 STDOUT terraform:       + arn               = (known after apply)
03:39:55.933 STDOUT terraform:       + id                = (known after apply)
03:39:55.933 STDOUT terraform:       + log_group_class   = (known after apply)
03:39:55.933 STDOUT terraform:       + name              = (known after apply)
03:39:55.933 STDOUT terraform:       + name_prefix       = (known after apply)
03:39:55.933 STDOUT terraform:       + retention_in_days = 0
03:39:55.933 STDOUT terraform:       + skip_destroy      = false
03:39:55.933 STDOUT terraform:       + tags              = {
03:39:55.933 STDOUT terraform:           + "Environment" = "dev"
03:39:55.933 STDOUT terraform:           + "Terragrunt"  = "true"
03:39:55.933 STDOUT terraform:           + "infra"       = "true"
03:39:55.933 STDOUT terraform:         }
03:39:55.933 STDOUT terraform:       + tags_all          = {
03:39:55.933 STDOUT terraform:           + "Data-classification" = "internal"
03:39:55.933 STDOUT terraform:           + "Environment"         = "dev"
03:39:55.934 STDOUT terraform:           + "Managed-by"          = "terragrunt"
03:39:55.934 STDOUT terraform:           + "Organization"        = "genopsx"
03:39:55.934 STDOUT terraform:           + "Terragrunt"          = "true"
03:39:55.934 STDOUT terraform:           + "infra"               = "true"
03:39:55.934 STDOUT terraform:         }
03:39:55.934 STDOUT terraform:     }
03:39:55.934 STDOUT terraform:   # module.vpc.aws_db_subnet_group.database[0] will be created
03:39:55.934 STDOUT terraform:   + resource "aws_db_subnet_group" "database" {
03:39:55.934 STDOUT terraform:       + arn                     = (known after apply)
03:39:55.934 STDOUT terraform:       + description             = "Database subnet group for sbx-dev-eu-west-1-infra-01-vpc"
03:39:55.934 STDOUT terraform:       + id                      = (known after apply)
03:39:55.934 STDOUT terraform:       + name                    = "sbx-dev-eu-west-1-infra-01-vpc"
03:39:55.934 STDOUT terraform:       + name_prefix             = (known after apply)
03:39:55.934 STDOUT terraform:       + subnet_ids              = (known after apply)
03:39:55.934 STDOUT terraform:       + supported_network_types = (known after apply)
03:39:55.934 STDOUT terraform:       + tags                    = {
03:39:55.934 STDOUT terraform:           + "Environment" = "dev"
03:39:55.934 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
03:39:55.934 STDOUT terraform:           + "Terragrunt"  = "true"
03:39:55.934 STDOUT terraform:           + "infra"       = "true"
03:39:55.934 STDOUT terraform:         }
03:39:55.934 STDOUT terraform:       + tags_all                = {
03:39:55.934 STDOUT terraform:           + "Data-classification" = "internal"
03:39:55.935 STDOUT terraform:           + "Environment"         = "dev"
03:39:55.935 STDOUT terraform:           + "Managed-by"          = "terragrunt"
03:39:55.935 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
03:39:55.935 STDOUT terraform:           + "Organization"        = "genopsx"
03:39:55.935 STDOUT terraform:           + "Terragrunt"          = "true"
03:39:55.935 STDOUT terraform:           + "infra"               = "true"
03:39:55.935 STDOUT terraform:         }
03:39:55.935 STDOUT terraform:       + vpc_id                  = (known after apply)
03:39:55.935 STDOUT terraform:     }
03:39:55.935 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
03:39:55.935 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
03:39:55.935 STDOUT terraform:       + arn                    = (known after apply)
03:39:55.935 STDOUT terraform:       + default_network_acl_id = (known after apply)
03:39:55.935 STDOUT terraform:       + id                     = (known after apply)
03:39:55.935 STDOUT terraform:       + owner_id               = (known after apply)
03:39:55.935 STDOUT terraform:       + tags                   = {
03:39:55.935 STDOUT terraform:           + "Environment" = "dev"
03:39:55.935 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
03:39:55.935 STDOUT terraform:           + "Terragrunt"  = "true"
03:39:55.935 STDOUT terraform:           + "infra"       = "true"
03:39:55.935 STDOUT terraform:         }
03:39:55.935 STDOUT terraform:       + tags_all               = {
03:39:55.935 STDOUT terraform:           + "Data-classification" = "internal"
03:39:55.935 STDOUT terraform:           + "Environment"         = "dev"
03:39:55.935 STDOUT terraform:           + "Managed-by"          = "terragrunt"
```

💰 Infracost estimate for `sbx/eu-west-1/infra-01/vpc`
```
Project: main

 Name                                                Monthly Qty  Unit              Monthly Cost   
                                                                                                   
 module.vpc.aws_nat_gateway.this[0]                                                                
 ├─ NAT gateway                                              730  hours                   $35.04   
 └─ Data processed                                Monthly cost depends on usage: $0.048 per GB     
                                                                                                   
 module.vpc.aws_cloudwatch_log_group.flow_log[0]                                                   
 ├─ Data ingested                                 Monthly cost depends on usage: $0.57 per GB      
 ├─ Archival Storage                              Monthly cost depends on usage: $0.03 per GB      
 └─ Insights queries data scanned                 Monthly cost depends on usage: $0.0057 per GB    
                                                                                                   
 OVERALL TOTAL                                                                           $35.04 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
35 cloud resources were detected:
∙ 2 were estimated
∙ 33 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $35 ┃           - ┃        $35 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```
